#### ExtensibleStorageFilter Members

---

|  |
| --- |
| ExtensibleStorageFilter Class   Constructors   Methods   Properties   See Also |

The  ExtensibleStorageFilter  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ExtensibleStorageFilter | Constructs a new instance of a filter to match elements with extensible storage data based on specific Schema id. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  ElementFilter  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | PassesFilter(Element) | Applies the filter to a given element. (Inherited from  ElementFilter  .) |
| Public method | PassesFilter(Document, ElementId) | Applies the filter to a given element. (Inherited from  ElementFilter  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Inverted | True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted. (Inherited from  ElementFilter  .) |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  ElementFilter  .) |
| Public property | SchemaGuid | Schema id used to filter elements with extensible storage data |

# See Also

ExtensibleStorageFilter Class

Autodesk.Revit.DB.ExtensibleStorage Namespace